public/sysbench-tidesql-v4-5-6-innodb-mariadb-v11-8-6-tidesdb-v9.3.6/innodb_oltp_point_select_run2.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 16069.78 qps: 16069.78 (r/w/o: 16069.78/0.00/0.00) lat (ms,95%): 1.47 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 18890.43 qps: 18890.43 (r/w/o: 18890.43/0.00/0.00) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 18835.54 qps: 18835.54 (r/w/o: 18835.54/0.00/0.00) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 18893.43 qps: 18893.43 (r/w/o: 18893.43/0.00/0.00) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 18872.19 qps: 18872.19 (r/w/o: 18872.19/0.00/0.00) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 18869.94 qps: 18869.94 (r/w/o: 18869.94/0.00/0.00) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 18900.99 qps: 18900.99 (r/w/o: 18900.99/0.00/0.00) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 18889.10 qps: 18889.10 (r/w/o: 18889.10/0.00/0.00) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 18854.18 qps: 18854.18 (r/w/o: 18854.18/0.00/0.00) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 18899.65 qps: 18899.65 (r/w/o: 18899.65/0.00/0.00) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 18895.55 qps: 18895.55 (r/w/o: 18895.55/0.00/0.00) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 18888.04 qps: 18888.04 (r/w/o: 18888.04/0.00/0.00) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2237624
        write:                           0
        other:                           0
        total:                           2237624
    transactions:                        2237624 (18646.63 per sec.)
    queries:                             2237624 (18646.63 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      18646.6322
    time elapsed:                        120.0015s
    total number of events:              2237624

Latency (ms):
         min:                                    0.02
         avg:                                    0.86
         max:                                  320.13
         95th percentile:                        1.25
         sum:                              1918991.56

Threads fairness:
    events (avg/stddev):           139851.5000/77.05
    execution time (avg/stddev):   119.9370/0.00