public/sysbench-tidesql-v4-5-6-innodb-mariadb-v11-8-6-tidesdb-v9.3.6/innodb_oltp_read_write_run1.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 318.86 qps: 6397.77 (r/w/o: 4482.62/1275.84/639.32) lat (ms,95%): 142.39 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 87.00 qps: 1738.72 (r/w/o: 1216.02/348.70/174.00) lat (ms,95%): 539.71 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 91.70 qps: 1830.00 (r/w/o: 1280.80/365.80/183.40) lat (ms,95%): 484.44 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 199.20 qps: 3987.30 (r/w/o: 2791.80/797.10/398.40) lat (ms,95%): 272.27 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 65.20 qps: 1303.19 (r/w/o: 911.79/261.00/130.40) lat (ms,95%): 669.89 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 172.80 qps: 3457.33 (r/w/o: 2419.92/691.81/345.60) lat (ms,95%): 320.17 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 135.70 qps: 2714.10 (r/w/o: 1900.50/542.20/271.40) lat (ms,95%): 419.45 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 78.10 qps: 1559.20 (r/w/o: 1090.80/312.20/156.20) lat (ms,95%): 549.52 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 120.00 qps: 2399.70 (r/w/o: 1680.10/479.60/240.00) lat (ms,95%): 450.77 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 170.40 qps: 3407.41 (r/w/o: 2384.41/682.20/340.80) lat (ms,95%): 292.60 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 84.60 qps: 1694.30 (r/w/o: 1186.80/338.30/169.20) lat (ms,95%): 502.20 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 146.70 qps: 2935.00 (r/w/o: 2054.70/586.90/293.40) lat (ms,95%): 356.70 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            234066
        write:                           66876
        other:                           33438
        total:                           334380
    transactions:                        16719  (139.14 per sec.)
    queries:                             334380 (2782.88 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      139.1438
    time elapsed:                        120.1563s
    total number of events:              16719

Latency (ms):
         min:                                   17.97
         avg:                                  114.93
         max:                                  881.60
         95th percentile:                      397.39
         sum:                              1921448.89

Threads fairness:
    events (avg/stddev):           1044.9375/5.04
    execution time (avg/stddev):   120.0906/0.04