public/sysbench-tidesql-v4-5-6-innodb-mariadb-v11-8-6-tidesdb-v9.3.6/innodb_oltp_read_write_run2.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 121.38 qps: 2449.88 (r/w/o: 1718.67/486.84/244.37) lat (ms,95%): 427.07 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 139.10 qps: 2776.34 (r/w/o: 1942.23/555.91/278.20) lat (ms,95%): 390.30 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 197.70 qps: 3955.59 (r/w/o: 2769.20/791.00/395.40) lat (ms,95%): 248.83 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 54.30 qps: 1085.90 (r/w/o: 760.30/217.00/108.60) lat (ms,95%): 682.06 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 230.20 qps: 4602.78 (r/w/o: 3222.08/920.30/460.40) lat (ms,95%): 211.60 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 58.80 qps: 1180.10 (r/w/o: 826.60/235.90/117.60) lat (ms,95%): 802.05 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 180.80 qps: 3614.10 (r/w/o: 2529.90/722.60/361.60) lat (ms,95%): 369.77 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 182.80 qps: 3655.39 (r/w/o: 2557.60/732.20/365.60) lat (ms,95%): 376.49 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 64.80 qps: 1294.50 (r/w/o: 907.10/257.80/129.60) lat (ms,95%): 861.95 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 253.80 qps: 5076.01 (r/w/o: 3552.90/1015.50/507.60) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 120.20 qps: 2404.29 (r/w/o: 1683.10/480.80/240.40) lat (ms,95%): 520.62 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 97.20 qps: 1940.60 (r/w/o: 1357.70/388.50/194.40) lat (ms,95%): 530.08 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            238378
        write:                           68108
        other:                           34054
        total:                           340540
    transactions:                        17027  (141.51 per sec.)
    queries:                             340540 (2830.20 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      141.5098
    time elapsed:                        120.3239s
    total number of events:              17027

Latency (ms):
         min:                                   18.45
         avg:                                  112.94
         max:                                 1544.08
         95th percentile:                      427.07
         sum:                              1923101.00

Threads fairness:
    events (avg/stddev):           1064.1875/3.32
    execution time (avg/stddev):   120.1938/0.09