public/sysbench-tidesql-v4-5-6-innodb-mariadb-v11-8-6-tidesdb-v9.3.6/innodb_oltp_update_index_run2.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 449.75 qps: 449.75 (r/w/o: 0.00/449.75/0.00) lat (ms,95%): 147.61 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 684.10 qps: 684.10 (r/w/o: 0.00/684.10/0.00) lat (ms,95%): 77.19 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 765.50 qps: 765.50 (r/w/o: 0.00/765.50/0.00) lat (ms,95%): 70.55 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 547.60 qps: 547.60 (r/w/o: 0.00/547.60/0.00) lat (ms,95%): 97.55 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 727.80 qps: 727.80 (r/w/o: 0.00/727.80/0.00) lat (ms,95%): 73.13 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 675.50 qps: 675.50 (r/w/o: 0.00/675.50/0.00) lat (ms,95%): 75.82 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 703.40 qps: 703.40 (r/w/o: 0.00/703.40/0.00) lat (ms,95%): 74.46 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 671.00 qps: 671.00 (r/w/o: 0.00/671.00/0.00) lat (ms,95%): 74.46 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 736.60 qps: 736.60 (r/w/o: 0.00/736.60/0.00) lat (ms,95%): 70.55 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 512.60 qps: 512.60 (r/w/o: 0.00/512.60/0.00) lat (ms,95%): 97.55 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 823.40 qps: 823.40 (r/w/o: 0.00/823.40/0.00) lat (ms,95%): 63.32 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 544.70 qps: 544.70 (r/w/o: 0.00/544.70/0.00) lat (ms,95%): 110.66 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           78436
        other:                           0
        total:                           78436
    transactions:                        78436  (653.57 per sec.)
    queries:                             78436  (653.57 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      653.5668
    time elapsed:                        120.0122s
    total number of events:              78436

Latency (ms):
         min:                                    0.05
         avg:                                   24.48
         max:                                 1003.89
         95th percentile:                       80.03
         sum:                              1920056.79

Threads fairness:
    events (avg/stddev):           4902.2500/44.24
    execution time (avg/stddev):   120.0035/0.00